---
kind: method
id: M:Autodesk.Revit.DB.BaseExportOptions.GetExportFontTable
source: html/6dc659b4-4131-c1bf-e418-4afc551095d0.htm
---
# Autodesk.Revit.DB.BaseExportOptions.GetExportFontTable Method

Gets font table.

## Syntax (C#)
```csharp
public ExportFontTable GetExportFontTable()
```